Revit 2026 API

# AnalyticalToPhysicalAssociationManagerAddAssociation(ISetElementId, ISetElementId) Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddAssociation(
	ISet<ElementId> analyticalElementIds,
	ISet<ElementId> physicalElementIds
)
```
```vb
Public Sub AddAssociation (
	analyticalElementIds As ISet(Of ElementId),
	physicalElementIds As ISet(Of ElementId)
)
```
```cpp
public:
void AddAssociation(
	ISet<ElementId^>^ analyticalElementIds,
	ISet<ElementId^>^ physicalElementIds
)
```
```fsharp
member AddAssociation :
        analyticalElementIds : ISet<ElementId> *
        physicalElementIds : ISet<ElementId> -> unit
```

#### Parameters

analyticalElementIds ISetElementId

physicalElementIds ISetElementId

#### Reference

AnalyticalToPhysicalAssociationManager Class

AddAssociation Overload

Autodesk.Revit.DB.Structure Namespace